test/lbm2Foam/lbmPoiseuille/0/f_1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
141.898
117.541
111.295
110.556
110.811
111.014
111.092
111.111
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           1;
        value           nonuniform List<scalar> 
200
(
167.607
167.418
167.382
167.383
167.387
167.389
167.39
167.39
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           1;
        value           nonuniform List<scalar> 
200
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           1;
        value           nonuniform List<scalar> 
600
(
141.898
117.541
111.295
110.556
110.811
111.014
111.092
111.111
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           1;
        value           nonuniform List<scalar> 
600
(
141.898
117.541
111.295
110.556
110.811
111.014
111.092
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
