test/lbm2Foam/lbmPoiseuille/0/f_4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
120000
(
116.272
111.653
111.114
111.04
111.078
111.101
111.109
111.111
...
)
;

boundaryField
{
    inlet
    {
        type            lbmWall;
        index           4;
        value           nonuniform List<scalar> 
200
(
114.434
114.339
114.332
114.333
114.336
114.336
114.336
114.336
...
)
;
    }
    outlet
    {
        type            lbmOutlet;
        index           4;
        value           nonuniform List<scalar> 
200
(
111.111
111.111
111.111
111.111
111.111
111.111
111.111
111.111
...
)
;
    }
    topWall
    {
        type            lbmWall;
        index           4;
        value           nonuniform List<scalar> 
600
(
116.272
111.653
111.114
111.04
111.078
111.101
111.109
111.111
...
)
;
    }
    bottomWall
    {
        type            lbmWall;
        index           4;
        value           nonuniform List<scalar> 
600
(
116.272
111.653
111.114
111.04
111.078
111.101
111.109
111.111
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
